/*Список Main:
https://docs.google.com/document/d/19V_mq-_9XPC8EZwVu1yGs88g55yVa9Z4shucuFQo4EY/edit?pref=2&pli=1

Main1 создали массив и в нем сделали копию этого массива

Main2 создали массив и в нем сделали копию этого массива в Random

Main3 создали массив и в нем сделали копию этого массива в Random только положительных и четных

Main4 Задача 1 создали массив А и сделали копию из этого массива в массив Б, но только четные и положительные значения

Main5 Задача 2 посчитать процентное соотношение положительных и отрицательных чисел в массиве

Main6 Задача 5 определить количество дней в году

Main7 Задача 6 посчитать факториал числа

Main8 НЕ РЕШИЛ Задача 3 Посчитать процентное соотношение прописных и строчных символов в строке

Main9 НЕ РЕШИЛ Задача 4 Сказать сколько цифр в числе и его знак.

Main10 НЕ РЕШИЛ Задача 7 Вывести все простые числа до заданного

Main11 Задача 8 Определить какое из 3 числел максимальное и вывести его.

Main12 НЕ РЕШИЛ Задача 9 В массиве сравить попарно (1 со 2, 2 с 3, 3 с 4 и тд) элементы и найти те 2, сумма которых максимальная.

Main13 НЕ РЕШИЛ Задача 10 В массиве сравить попарно (1 со 2, 1 с 3, 1 с 4 и тд) элементы и найти те 2, сумма которых максимальная.

Main14 вывели двухмерный массив

Main15 двухмерный массив посчитали процентное соотношение положит и отриц чисел

Main16 двухмерный массив вывели полож и отриц и процент,

Main17 многомерный массив факториал числа

Main18 Задача 9 Многомерный массив В массиве сравить попарно (1 со 2, 2 с 3, 3 с 4 и тд) элементы и найти те 2, сумма которых максимальная.

Main19 Задача 10 Многомерный массив В массиве сравить попарно (1 со 2, 1 с 3, 1 с 4 и тд) элементы и найти те 2, сумма которых максимальная.

Main20 многомерный массив

Main21 многомерный массив посчитать сумму элементов в каждой строке

Main22 многомерный массив посчитать сумму элементов в каждой столбике

Main23 многомерный массив посчитать таблицу умножения

Main24 многомерный массив посчитать таблицу умножения и вывести любое число заданное

Main25 Задача 3 не решена
// Дано число n. Создайте массив int A[n][n], и заполните его по следующему правилу:
// Числа на диагонали, идущей из правого верхнего в левый нижний угол равны 1.
// Числа, стоящие выше этой диагонали, равны 0. Числа, стоящие ниже этой диагонали, равны 2.

Main26 многомерный массив посмотреть его размерность

Main27 массив как проходит рабочий день

Main28
Main29
Main30
Main31
Main32
Main33
Main34
Main35
Main36
Main37*/
