package by.mix;

//import java.util.Random;

// Задача 3 Посчитать процентное соотношение прописных и строчных символов в строке

/*public class Main8 {
    public static void main(String[] args) {

        //String [] pred = {"У меня Ничего не выходиТ - ТакИ я програмист"};
        String predl = "У меня Ничего не выходиТ";
        int sumpredl = predl.length();
        int sumB = 0;
        int sumM = 0;
        for (int i = 0; i <= predl; i++) {


            // вывод массива для себя, что бы витеть цифры
            for (int i = 0; i <= predl; i++) {
                System.out.println(predl);
            }

            // вывод суммы больших и маленьких букв
            for (int i = 0; i <= predl; i++) {
                if (sumB[i] >= 'А' && sumB[i] <= 'Ю') {
                    sumB++;
                } else {
                    if (sumM[i] >= 'а' && sumM[i] <= 'ю') {
                        sumM++;
                    }
                }
            }
            System.out.println("Сумма прописных букв = " + sumB + ", что составляет " + (sumB * 100) / sumpredl + " %");
            System.out.println("Сумма строчных букв = " + sumM + ", что составляет " + (sumM * 100) / sumpredl + " %");
        }
    }
}*/



// http://www.cyberforum.ru/java-j2se/thread445697.html
// http://www.inf1.info/kumir/percentage-char прописные и строчные
// http://pas1.ru/percentage-char
// http://study-java.ru/uroki-java/rabota-so-strokami-v-java-osnovnye-metody-klassa-string/

